MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX130F128L.PIC
              <edc:DCRFieldSemantic edc:cname="PWP183K" edc:desc="First 183K" edc:when="(field &amp; 0x3ff) == 0x348"/>
              <edc:DCRFieldSemantic edc:cname="PWP184K" edc:desc="First 184K" edc:when="(field &amp; 0x3ff) == 0x347"/>
              <edc:DCRFieldSemantic edc:cname="PWP185K" edc:desc="First 185K" edc:when="(field &amp; 0x3ff) == 0x346"/>
              <edc:DCRFieldSemantic edc:cname="PWP186K" edc:desc="First 186K" edc:when="(field &amp; 0x3ff) == 0x345"/>
              <edc:DCRFieldSemantic edc:cname="PWP187K" edc:desc="First 187K" edc:when="(field &amp; 0x3ff) == 0x344"/>
              <edc:DCRFieldSemantic edc:cname="PWP188K" edc:desc="First 188K" edc:when="(field &amp; 0x3ff) == 0x343"/>
              <edc:DCRFieldSemantic edc:cname="PWP189K" edc:desc="First 189K" edc:when="(field &amp; 0x3ff) == 0x342"/>
              <edc:DCRFieldSemantic edc:cname="PWP190K" edc:desc="First 190K" edc:when="(field &amp; 0x3ff) == 0x341"/>
              <edc:DCRFieldSemantic edc:cname="PWP191K" edc:desc="First 191K" edc:when="(field &amp; 0x3ff) == 0x340"/>
              <edc:DCRFieldSemantic edc:cname="PWP192K" edc:desc="First 192K" edc:when="(field &amp; 0x3ff) == 0x33f"/>
              <edc:DCRFieldSemantic edc:cname="PWP193K" edc:desc="First 193K" edc:when="(field &amp; 0x3ff) == 0x33e"/>
              <edc:DCRFieldSemantic edc:cname="PWP194K" edc:desc="First 194K" edc:when="(field &amp; 0x3ff) == 0x33d"/>
              <edc:DCRFieldSemantic edc:cname="PWP195K" edc:desc="First 195K" edc:when="(field &amp; 0x3ff) == 0x33c"/>
              <edc:DCRFieldSemantic edc:cname="PWP196K" edc:desc="First 196K" edc:when="(field &amp; 0x3ff) == 0x33b"/>
              <edc:DCRFieldSemantic edc:cname="PWP197K" edc:desc="First 197K" edc:when="(field &amp; 0x3ff) == 0x33a"/>
              <edc:DCRFieldSemantic edc:cname="PWP198K" edc:desc="First 198K" edc:when="(field &amp; 0x3ff) == 0x339"/>
              <edc:DCRFieldSemantic edc:cname="PWP199K" edc:desc="First 199K" edc:when="(field &amp; 0x3ff) == 0x338"/>
              <edc:DCRFieldSemantic edc:cname="PWP200K" edc:desc="First 200K" edc:when="(field &amp; 0x3ff) == 0x337"/>
              <edc:DCRFieldSemantic edc:cname="PWP201K" edc:desc="First 201K" edc:when="(field &amp; 0x3ff) == 0x336"/>
              <edc:DCRFieldSemantic edc:cname="PWP202K" edc:desc="First 202K" edc:when="(field &amp; 0x3ff) == 0x335"/>
              <edc:DCRFieldSemantic edc:cname="PWP203K" edc:desc="First 203K" edc:when="(field &amp; 0x3ff) == 0x334"/>
              <edc:DCRFieldSemantic edc:cname="PWP204K" edc:desc="First 204K" edc:when="(field &amp; 0x3ff) == 0x333"/>
              <edc:DCRFieldSemantic edc:cname="PWP205K" edc:desc="First 205K" edc:when="(field &amp; 0x3ff) == 0x332"/>
              <edc:DCRFieldSemantic edc:cname="PWP206K" edc:desc="First 206K" edc:when="(field &amp; 0x3ff) == 0x331"/>
              <edc:DCRFieldSemantic edc:cname="PWP207K" edc:desc="First 207K" edc:when="(field &amp; 0x3ff) == 0x330"/>
              <edc:DCRFieldSemantic edc:cname="PWP208K" edc:desc="First 208K" edc:when="(field &amp; 0x3ff) == 0x32f"/>
              <edc:DCRFieldSemantic edc:cname="PWP209K" edc:desc="First 209K" edc:when="(field &amp; 0x3ff) == 0x32e"/>
              <edc:DCRFieldSemantic edc:cname="PWP210K" edc:desc="First 210K" edc:when="(field &amp; 0x3ff) == 0x32d"/>
              <edc:DCRFieldSemantic edc:cname="PWP211K" edc:desc="First 211K" edc:when="(field &amp; 0x3ff) == 0x32c"/>
              <edc:DCRFieldSemantic edc:cname="PWP212K" edc:desc="First 212K" edc:when="(field &amp; 0x3ff) == 0x32b"/>
              <edc:DCRFieldSemantic edc:cname="PWP213K" edc:desc="First 213K" edc:when="(field &amp; 0x3ff) == 0x32a"/>
              <edc:DCRFieldSemantic edc:cname="PWP214K" edc:desc="First 214K" edc:when="(field &amp; 0x3ff) == 0x329"/>
              <edc:DCRFieldSemantic edc:cname="PWP215K" edc:desc="First 215K" edc:when="(field &amp; 0x3ff) == 0x328"/>
              <edc:DCRFieldSemantic edc:cname="PWP216K" edc:desc="First 216K" edc:when="(field &amp; 0x3ff) == 0x327"/>
              <edc:DCRFieldSemantic edc:cname="PWP217K" edc:desc="First 217K" edc:when="(field &amp; 0x3ff) == 0x326"/>
              <edc:DCRFieldSemantic edc:cname="PWP218K" edc:desc="First 218K" edc:when="(field &amp; 0x3ff) == 0x325"/>
              <edc:DCRFieldSemantic edc:cname="PWP219K" edc:desc="First 219K" edc:when="(field &amp; 0x3ff) == 0x324"/>
              <edc:DCRFieldSemantic edc:cname="PWP220K" edc:desc="First 220K" edc:when="(field &amp; 0x3ff) == 0x323"/>
              <edc:DCRFieldSemantic edc:cname="PWP221K" edc:desc="First 221K" edc:when="(field &amp; 0x3ff) == 0x322"/>
              <edc:DCRFieldSemantic edc:cname="PWP222K" edc:desc="First 222K" edc:when="(field &amp; 0x3ff) == 0x321"/>
              <edc:DCRFieldSemantic edc:cname="PWP223K" edc:desc="First 223K" edc:when="(field &amp; 0x3ff) == 0x320"/>
              <edc:DCRFieldSemantic edc:cname="PWP224K" edc:desc="First 224K" edc:when="(field &amp; 0x3ff) == 0x31f"/>
              <edc:DCRFieldSemantic edc:cname="PWP225K" edc:desc="First 225K" edc:when="(field &amp; 0x3ff) == 0x31e"/>
              <edc:DCRFieldSemantic edc:cname="PWP226K" edc:desc="First 226K" edc:when="(field &amp; 0x3ff) == 0x31d"/>
              <edc:DCRFieldSemantic edc:cname="PWP227K" edc:desc="First 227K" edc:when="(field &amp; 0x3ff) == 0x31c"/>
              <edc:DCRFieldSemantic edc:cname="PWP228K" edc:desc="First 228K" edc:when="(field &amp; 0x3ff) == 0x31b"/>
              <edc:DCRFieldSemantic edc:cname="PWP229K" edc:desc="First 229K" edc:when="(field &amp; 0x3ff) == 0x31a"/>
              <edc:DCRFieldSemantic edc:cname="PWP230K" edc:desc="First 230K" edc:when="(field &amp; 0x3ff) == 0x319"/>
              <edc:DCRFieldSemantic edc:cname="PWP231K" edc:desc="First 231K" edc:when="(field &amp; 0x3ff) == 0x318"/>
              <edc:DCRFieldSemantic edc:cname="PWP232K" edc:desc="First 232K" edc:when="(field &amp; 0x3ff) == 0x317"/>
              <edc:DCRFieldSemantic edc:cname="PWP233K" edc:desc="First 233K" edc:when="(field &amp; 0x3ff) == 0x316"/>
              <edc:DCRFieldSemantic edc:cname="PWP234K" edc:desc="First 234K" edc:when="(field &amp; 0x3ff) == 0x315"/>
              <edc:DCRFieldSemantic edc:cname="PWP235K" edc:desc="First 235K" edc:when="(field &amp; 0x3ff) == 0x314"/>
              <edc:DCRFieldSemantic edc:cname="PWP236K" edc:desc="First 236K" edc:when="(field &amp; 0x3ff) == 0x313"/>
              <edc:DCRFieldSemantic edc:cname="PWP237K" edc:desc="First 237K" edc:when="(field &amp; 0x3ff) == 0x312"/>
              <edc:DCRFieldSemantic edc:cname="PWP238K" edc:desc="First 238K" edc:when="(field &amp; 0x3ff) == 0x311"/>
              <edc:DCRFieldSemantic edc:cname="PWP239K" edc:desc="First 239K" edc:when="(field &amp; 0x3ff) == 0x310"/>
              <edc:DCRFieldSemantic edc:cname="PWP240K" edc:desc="First 240K" edc:when="(field &amp; 0x3ff) == 0x30f"/>
              <edc:DCRFieldSemantic edc:cname="PWP241K" edc:desc="First 241K" edc:when="(field &amp; 0x3ff) == 0x30e"/>
              <edc:DCRFieldSemantic edc:cname="PWP242K" edc:desc="First 242K" edc:when="(field &amp; 0x3ff) == 0x30d"/>
              <edc:DCRFieldSemantic edc:cname="PWP243K" edc:desc="First 243K" edc:when="(field &amp; 0x3ff) == 0x30c"/>
              <edc:DCRFieldSemantic edc:cname="PWP244K" edc:desc="First 244K" edc:when="(field &amp; 0x3ff) == 0x30b"/>
              <edc:DCRFieldSemantic edc:cname="PWP245K" edc:desc="First 245K" edc:when="(field &amp; 0x3ff) == 0x30a"/>
              <edc:DCRFieldSemantic edc:cname="PWP246K" edc:desc="First 246K" edc:when="(field &amp; 0x3ff) == 0x309"/>
              <edc:DCRFieldSemantic edc:cname="PWP247K" edc:desc="First 247K" edc:when="(field &amp; 0x3ff) == 0x308"/>
              <edc:DCRFieldSemantic edc:cname="PWP248K" edc:desc="First 248K" edc:when="(field &amp; 0x3ff) == 0x307"/>
              <edc:DCRFieldSemantic edc:cname="PWP249K" edc:desc="First 249K" edc:when="(field &amp; 0x3ff) == 0x306"/>
              <edc:DCRFieldSemantic edc:cname="PWP250K" edc:desc="First 250K" edc:when="(field &amp; 0x3ff) == 0x305"/>
              <edc:DCRFieldSemantic edc:cname="PWP251K" edc:desc="First 251K" edc:when="(field &amp; 0x3ff) == 0x304"/>
              <edc:DCRFieldSemantic edc:cname="PWP252K" edc:desc="First 252K" edc:when="(field &amp; 0x3ff) == 0x303"/>
              <edc:DCRFieldSemantic edc:cname="PWP253K" edc:desc="First 253K" edc:when="(field &amp; 0x3ff) == 0x302"/>
              <edc:DCRFieldSemantic edc:cname="PWP254K" edc:desc="First 254K" edc:when="(field &amp; 0x3ff) == 0x301"/>
              <edc:DCRFieldSemantic edc:cname="PWP255K" edc:desc="First 255K" edc:when="(field &amp; 0x3ff) == 0x300"/>
              <edc:DCRFieldSemantic edc:cname="PWP256K" edc:desc="First 256K" edc:when="(field &amp; 0x3ff) == 0x2ff"/>
              <edc:DCRFieldSemantic edc:cname="PWP257K" edc:desc="First 257K" edc:when="(field &amp; 0x3ff) == 0x2fe"/>
              <edc:DCRFieldSemantic edc:cname="PWP258K" edc:desc="First 258K" edc:when="(field &amp; 0x3ff) == 0x2fd"/>
              <edc:DCRFieldSemantic edc:cname="PWP259K" edc:desc="First 259K" edc:when="(field &amp; 0x3ff) == 0x2fc"/>
              <edc:DCRFieldSemantic edc:cname="PWP260K" edc:desc="First 260K" edc:when="(field &amp; 0x3ff) == 0x2fb"/>
              <edc:DCRFieldSemantic edc:cname="PWP261K" edc:desc="First 261K" edc:when="(field &amp; 0x3ff) == 0x2fa"/>
              <edc:DCRFieldSemantic edc:cname="PWP262K" edc:desc="First 262K" edc:when="(field &amp; 0x3ff) == 0x2f9"/>
              <edc:DCRFieldSemantic edc:cname="PWP263K" edc:desc="First 263K" edc:when="(field &amp; 0x3ff) == 0x2f8"/>
              <edc:DCRFieldSemantic edc:cname="PWP264K" edc:desc="First 264K" edc:when="(field &amp; 0x3ff) == 0x2f7"/>
              <edc:DCRFieldSemantic edc:cname="PWP265K" edc:desc="First 265K" edc:when="(field &amp; 0x3ff) == 0x2f6"/>
              <edc:DCRFieldSemantic edc:cname="PWP266K" edc:desc="First 266K" edc:when="(field &amp; 0x3ff) == 0x2f5"/>
              <edc:DCRFieldSemantic edc:cname="PWP267K" edc:desc="First 267K" edc:when="(field &amp; 0x3ff) == 0x2f4"/>
              <edc:DCRFieldSemantic edc:cname="PWP268K" edc:desc="First 268K" edc:when="(field &amp; 0x3ff) == 0x2f3"/>
              <edc:DCRFieldSemantic edc:cname="PWP269K" edc:desc="First 269K" edc:when="(field &amp; 0x3ff) == 0x2f2"/>
              <edc:DCRFieldSemantic edc:cname="PWP270K" edc:desc="First 270K" edc:when="(field &amp; 0x3ff) == 0x2f1"/>
              <edc:DCRFieldSemantic edc:cname="PWP271K" edc:desc="First 271K" edc:when="(field &amp; 0x3ff) == 0x2f0"/>
              <edc:DCRFieldSemantic edc:cname="PWP272K" edc:desc="First 272K" edc:when="(field &amp; 0x3ff) == 0x2ef"/>
              <edc:DCRFieldSemantic edc:cname="PWP273K" edc:desc="First 273K" edc:when="(field &amp; 0x3ff) == 0x2ee"/>
              <edc:DCRFieldSemantic edc:cname="PWP274K" edc:desc="First 274K" edc:when="(field &amp; 0x3ff) == 0x2ed"/>
              <edc:DCRFieldSemantic edc:cname="PWP275K" edc:desc="First 275K" edc:when="(field &amp; 0x3ff) == 0x2ec"/>
              <edc:DCRFieldSemantic edc:cname="PWP276K" edc:desc="First 276K" edc:when="(field &amp; 0x3ff) == 0x2eb"/>
              <edc:DCRFieldSemantic edc:cname="PWP277K" edc:desc="First 277K" edc:when="(field &amp; 0x3ff) == 0x2ea"/>
              <edc:DCRFieldSemantic edc:cname="PWP278K" edc:desc="First 278K" edc:when="(field &amp; 0x3ff) == 0x2e9"/>
              <edc:DCRFieldSemantic edc:cname="PWP279K" edc:desc="First 279K" edc:when="(field &amp; 0x3ff) == 0x2e8"/>
              <edc:DCRFieldSemantic edc:cname="PWP280K" edc:desc="First 280K" edc:when="(field &amp; 0x3ff) == 0x2e7"/>
              <edc:DCRFieldSemantic edc:cname="PWP281K" edc:desc="First 281K" edc:when="(field &amp; 0x3ff) == 0x2e6"/>
              <edc:DCRFieldSemantic edc:cname="PWP282K" edc:desc="First 282K" edc:when="(field &amp; 0x3ff) == 0x2e5"/>
              <edc:DCRFieldSemantic edc:cname="PWP283K" edc:desc="First 283K" edc:when="(field &amp; 0x3ff) == 0x2e4"/>
              <edc:DCRFieldSemantic edc:cname="PWP284K" edc:desc="First 284K" edc:when="(field &amp; 0x3ff) == 0x2e3"/>
              <edc:DCRFieldSemantic edc:cname="PWP285K" edc:desc="First 285K" edc:when="(field &amp; 0x3ff) == 0x2e2"/>
              <edc:DCRFieldSemantic edc:cname="PWP286K" edc:desc="First 286K" edc:when="(field &amp; 0x3ff) == 0x2e1"/>
              <edc:DCRFieldSemantic edc:cname="PWP287K" edc:desc="First 287K" edc:when="(field &amp; 0x3ff) == 0x2e0"/>
              <edc:DCRFieldSemantic edc:cname="PWP288K" edc:desc="First 288K" edc:when="(field &amp; 0x3ff) == 0x2df"/>
              <edc:DCRFieldSemantic edc:cname="PWP289K" edc:desc="First 289K" edc:when="(field &amp; 0x3ff) == 0x2de"/>
              <edc:DCRFieldSemantic edc:cname="PWP290K" edc:desc="First 290K" edc:when="(field &amp; 0x3ff) == 0x2dd"/>
              <edc:DCRFieldSemantic edc:cname="PWP291K" edc:desc="First 291K" edc:when="(field &amp; 0x3ff) == 0x2dc"/>
              <edc:DCRFieldSemantic edc:cname="PWP292K" edc:desc="First 292K" edc:when="(field &amp; 0x3ff) == 0x2db"/>
              <edc:DCRFieldSemantic edc:cname="PWP293K" edc:desc="First 293K" edc:when="(field &amp; 0x3ff) == 0x2da"/>
              <edc:DCRFieldSemantic edc:cname="PWP294K" edc:desc="First 294K" edc:when="(field &amp; 0x3ff) == 0x2d9"/>
              <edc:DCRFieldSemantic edc:cname="PWP295K" edc:desc="First 295K" edc:when="(field &amp; 0x3ff) == 0x2d8"/>
              <edc:DCRFieldSemantic edc:cname="PWP296K" edc:desc="First 296K" edc:when="(field &amp; 0x3ff) == 0x2d7"/>
              <edc:DCRFieldSemantic edc:cname="PWP297K" edc:desc="First 297K" edc:when="(field &amp; 0x3ff) == 0x2d6"/>
              <edc:DCRFieldSemantic edc:cname="PWP298K" edc:desc="First 298K" edc:when="(field &amp; 0x3ff) == 0x2d5"/>
              <edc:DCRFieldSemantic edc:cname="PWP299K" edc:desc="First 299K" edc:when="(field &amp; 0x3ff) == 0x2d4"/>
              <edc:DCRFieldSemantic edc:cname="PWP300K" edc:desc="First 300K" edc:when="(field &amp; 0x3ff) == 0x2d3"/>
              <edc:DCRFieldSemantic edc:cname="PWP301K" edc:desc="First 301K" edc:when="(field &amp; 0x3ff) == 0x2d2"/>
              <edc:DCRFieldSemantic edc:cname="PWP302K" edc:desc="First 302K" edc:when="(field &amp; 0x3ff) == 0x2d1"/>
              <edc:DCRFieldSemantic edc:cname="PWP303K" edc:desc="First 303K" edc:when="(field &amp; 0x3ff) == 0x2d0"/>
              <edc:DCRFieldSemantic edc:cname="PWP304K" edc:desc="First 304K" edc:when="(field &amp; 0x3ff) == 0x2cf"/>
              <edc:DCRFieldSemantic edc:cname="PWP305K" edc:desc="First 305K" edc:when="(field &amp; 0x3ff) == 0x2ce"/>
              <edc:DCRFieldSemantic edc:cname="PWP306K" edc:desc="First 306K" edc:when="(field &amp; 0x3ff) == 0x2cd"/>
              <edc:DCRFieldSemantic edc:cname="PWP307K" edc:desc="First 307K" edc:when="(field &amp; 0x3ff) == 0x2cc"/>
              <edc:DCRFieldSemantic edc:cname="PWP308K" edc:desc="First 308K" edc:when="(field &amp; 0x3ff) == 0x2cb"/>
              <edc:DCRFieldSemantic edc:cname="PWP309K" edc:desc="First 309K" edc:when="(field &amp; 0x3ff) == 0x2ca"/>
              <edc:DCRFieldSemantic edc:cname="PWP310K" edc:desc="First 310K" edc:when="(field &amp; 0x3ff) == 0x2c9"/>
              <edc:DCRFieldSemantic edc:cname="PWP311K" edc:desc="First 311K" edc:when="(field &amp; 0x3ff) == 0x2c8"/>
              <edc:DCRFieldSemantic edc:cname="PWP312K" edc:desc="First 312K" edc:when="(field &amp; 0x3ff) == 0x2c7"/>
              <edc:DCRFieldSemantic edc:cname="PWP313K" edc:desc="First 313K" edc:when="(field &amp; 0x3ff) == 0x2c6"/>
              <edc:DCRFieldSemantic edc:cname="PWP314K" edc:desc="First 314K" edc:when="(field &amp; 0x3ff) == 0x2c5"/>
              <edc:DCRFieldSemantic edc:cname="PWP315K" edc:desc="First 315K" edc:when="(field &amp; 0x3ff) == 0x2c4"/>
              <edc:DCRFieldSemantic edc:cname="PWP316K" edc:desc="First 316K" edc:when="(field &amp; 0x3ff) == 0x2c3"/>
              <edc:DCRFieldSemantic edc:cname="PWP317K" edc:desc="First 317K" edc:when="(field &amp; 0x3ff) == 0x2c2"/>
              <edc:DCRFieldSemantic edc:cname="PWP318K" edc:desc="First 318K" edc:when="(field &amp; 0x3ff) == 0x2c1"/>
              <edc:DCRFieldSemantic edc:cname="PWP319K" edc:desc="First 319K" edc:when="(field &amp; 0x3ff) == 0x2c0"/>
              <edc:DCRFieldSemantic edc:cname="PWP320K" edc:desc="First 320K" edc:when="(field &amp; 0x3ff) == 0x2bf"/>
              <edc:DCRFieldSemantic edc:cname="PWP321K" edc:desc="First 321K" edc:when="(field &amp; 0x3ff) == 0x2be"/>
              <edc:DCRFieldSemantic edc:cname="PWP322K" edc:desc="First 322K" edc:when="(field &amp; 0x3ff) == 0x2bd"/>
              <edc:DCRFieldSemantic edc:cname="PWP323K" edc:desc="First 323K" edc:when="(field &amp; 0x3ff) == 0x2bc"/>
              <edc:DCRFieldSemantic edc:cname="PWP324K" edc:desc="First 324K" edc:when="(field &amp; 0x3ff) == 0x2bb"/>
              <edc:DCRFieldSemantic edc:cname="PWP325K" edc:desc="First 325K" edc:when="(field &amp; 0x3ff) == 0x2ba"/>
              <edc:DCRFieldSemantic edc:cname="PWP326K" edc:desc="First 326K" edc:when="(field &amp; 0x3ff) == 0x2b9"/>
              <edc:DCRFieldSemantic edc:cname="PWP327K" edc:desc="First 327K" edc:when="(field &amp; 0x3ff) == 0x2b8"/>
              <edc:DCRFieldSemantic edc:cname="PWP328K" edc:desc="First 328K" edc:when="(field &amp; 0x3ff) == 0x2b7"/>
              <edc:DCRFieldSemantic edc:cname="PWP329K" edc:desc="First 329K" edc:when="(field &amp; 0x3ff) == 0x2b6"/>
              <edc:DCRFieldSemantic edc:cname="PWP330K" edc:desc="First 330K" edc:when="(field &amp; 0x3ff) == 0x2b5"/>
              <edc:DCRFieldSemantic edc:cname="PWP331K" edc:desc="First 331K" edc:when="(field &amp; 0x3ff) == 0x2b4"/>
              <edc:DCRFieldSemantic edc:cname="PWP332K" edc:desc="First 332K" edc:when="(field &amp; 0x3ff) == 0x2b3"/>
              <edc:DCRFieldSemantic edc:cname="PWP333K" edc:desc="First 333K" edc:when="(field &amp; 0x3ff) == 0x2b2"/>
              <edc:DCRFieldSemantic edc:cname="PWP334K" edc:desc="First 334K" edc:when="(field &amp; 0x3ff) == 0x2b1"/>
              <edc:DCRFieldSemantic edc:cname="PWP335K" edc:desc="First 335K" edc:when="(field &amp; 0x3ff) == 0x2b0"/>
              <edc:DCRFieldSemantic edc:cname="PWP336K" edc:desc="First 336K" edc:when="(field &amp; 0x3ff) == 0x2af"/>
              <edc:DCRFieldSemantic edc:cname="PWP337K" edc:desc="First 337K" edc:when="(field &amp; 0x3ff) == 0x2ae"/>
              <edc:DCRFieldSemantic edc:cname="PWP338K" edc:desc="First 338K" edc:when="(field &amp; 0x3ff) == 0x2ad"/>
              <edc:DCRFieldSemantic edc:cname="PWP339K" edc:desc="First 339K" edc:when="(field &amp; 0x3ff) == 0x2ac"/>
              <edc:DCRFieldSemantic edc:cname="PWP340K" edc:desc="First 340K" edc:when="(field &amp; 0x3ff) == 0x2ab"/>
              <edc:DCRFieldSemantic edc:cname="PWP341K" edc:desc="First 341K" edc:when="(field &amp; 0x3ff) == 0x2aa"/>
              <edc:DCRFieldSemantic edc:cname="PWP342K" edc:desc="First 342K" edc:when="(field &amp; 0x3ff) == 0x2a9"/>
              <edc:DCRFieldSemantic edc:cname="PWP343K" edc:desc="First 343K" edc:when="(field &amp; 0x3ff) == 0x2a8"/>
              <edc:DCRFieldSemantic edc:cname="PWP344K" edc:desc="First 344K" edc:when="(field &amp; 0x3ff) == 0x2a7"/>
              <edc:DCRFieldSemantic edc:cname="PWP345K" edc:desc="First 345K" edc:when="(field &amp; 0x3ff) == 0x2a6"/>
              <edc:DCRFieldSemantic edc:cname="PWP346K" edc:desc="First 346K" edc:when="(field &amp; 0x3ff) == 0x2a5"/>
              <edc:DCRFieldSemantic edc:cname="PWP347K" edc:desc="First 347K" edc:when="(field &amp; 0x3ff) == 0x2a4"/>
              <edc:DCRFieldSemantic edc:cname="PWP348K" edc:desc="First 348K" edc:when="(field &amp; 0x3ff) == 0x2a3"/>
              <edc:DCRFieldSemantic edc:cname="PWP349K" edc:desc="First 349K" edc:when="(field &amp; 0x3ff) == 0x2a2"/>
              <edc:DCRFieldSemantic edc:cname="PWP350K" edc:desc="First 350K" edc:when="(field &amp; 0x3ff) == 0x2a1"/>
              <edc:DCRFieldSemantic edc:cname="PWP351K" edc:desc="First 351K" edc:when="(field &amp; 0x3ff) == 0x2a0"/>
              <edc:DCRFieldSemantic edc:cname="PWP352K" edc:desc="First 352K" edc:when="(field &amp; 0x3ff) == 0x29f"/>
              <edc:DCRFieldSemantic edc:cname="PWP353K" edc:desc="First 353K" edc:when="(field &amp; 0x3ff) == 0x29e"/>
              <edc:DCRFieldSemantic edc:cname="PWP354K" edc:desc="First 354K" edc:when="(field &amp; 0x3ff) == 0x29d"/>
              <edc:DCRFieldSemantic edc:cname="PWP355K" edc:desc="First 355K" edc:when="(field &amp; 0x3ff) == 0x29c"/>
              <edc:DCRFieldSemantic edc:cname="PWP356K" edc:desc="First 356K" edc:when="(field &amp; 0x3ff) == 0x29b"/>
              <edc:DCRFieldSemantic edc:cname="PWP357K" edc:desc="First 357K" edc:when="(field &amp; 0x3ff) == 0x29a"/>
              <edc:DCRFieldSemantic edc:cname="PWP358K" edc:desc="First 358K" edc:when="(field &amp; 0x3ff) == 0x299"/>
              <edc:DCRFieldSemantic edc:cname="PWP359K" edc:desc="First 359K" edc:when="(field &amp; 0x3ff) == 0x298"/>
              <edc:DCRFieldSemantic edc:cname="PWP360K" edc:desc="First 360K" edc:when="(field &amp; 0x3ff) == 0x297"/>
              <edc:DCRFieldSemantic edc:cname="PWP361K" edc:desc="First 361K" edc:when="(field &amp; 0x3ff) == 0x296"/>
              <edc:DCRFieldSemantic edc:cname="PWP362K" edc:desc="First 362K" edc:when="(field &amp; 0x3ff) == 0x295"/>
              <edc:DCRFieldSemantic edc:cname="PWP363K" edc:desc="First 363K" edc:when="(field &amp; 0x3ff) == 0x294"/>
              <edc:DCRFieldSemantic edc:cname="PWP364K" edc:desc="First 364K" edc:when="(field &amp; 0x3ff) == 0x293"/>
              <edc:DCRFieldSemantic edc:cname="PWP365K" edc:desc="First 365K" edc:when="(field &amp; 0x3ff) == 0x292"/>
              <edc:DCRFieldSemantic edc:cname="PWP366K" edc:desc="First 366K" edc:when="(field &amp; 0x3ff) == 0x291"/>
              <edc:DCRFieldSemantic edc:cname="PWP367K" edc:desc="First 367K" edc:when="(field &amp; 0x3ff) == 0x290"/>
              <edc:DCRFieldSemantic edc:cname="PWP368K" edc:desc="First 368K" edc:when="(field &amp; 0x3ff) == 0x28f"/>
              <edc:DCRFieldSemantic edc:cname="PWP369K" edc:desc="First 369K" edc:when="(field &amp; 0x3ff) == 0x28e"/>
              <edc:DCRFieldSemantic edc:cname="PWP370K" edc:desc="First 370K" edc:when="(field &amp; 0x3ff) == 0x28d"/>
              <edc:DCRFieldSemantic edc:cname="PWP371K" edc:desc="First 371K" edc:when="(field &amp; 0x3ff) == 0x28c"/>
              <edc:DCRFieldSemantic edc:cname="PWP372K" edc:desc="First 372K" edc:when="(field &amp; 0x3ff) == 0x28b"/>
              <edc:DCRFieldSemantic edc:cname="PWP373K" edc:desc="First 373K" edc:when="(field &amp; 0x3ff) == 0x28a"/>
              <edc:DCRFieldSemantic edc:cname="PWP374K" edc:desc="First 374K" edc:when="(field &amp; 0x3ff) == 0x289"/>
              <edc:DCRFieldSemantic edc:cname="PWP375K" edc:desc="First 375K" edc:when="(field &amp; 0x3ff) == 0x288"/>
              <edc:DCRFieldSemantic edc:cname="PWP376K" edc:desc="First 376K" edc:when="(field &amp; 0x3ff) == 0x287"/>
              <edc:DCRFieldSemantic edc:cname="PWP377K" edc:desc="First 377K" edc:when="(field &amp; 0x3ff) == 0x286"/>
              <edc:DCRFieldSemantic edc:cname="PWP378K" edc:desc="First 378K" edc:when="(field &amp; 0x3ff) == 0x285"/>
              <edc:DCRFieldSemantic edc:cname="PWP379K" edc:desc="First 379K" edc:when="(field &amp; 0x3ff) == 0x284"/>
              <edc:DCRFieldSemantic edc:cname="PWP380K" edc:desc="First 380K" edc:when="(field &amp; 0x3ff) == 0x283"/>
              <edc:DCRFieldSemantic edc:cname="PWP381K" edc:desc="First 381K" edc:when="(field &amp; 0x3ff) == 0x282"/>
              <edc:DCRFieldSemantic edc:cname="PWP382K" edc:desc="First 382K" edc:when="(field &amp; 0x3ff) == 0x281"/>
