MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX130F128L.PIC
              <edc:DCRFieldSemantic edc:cname="PWP383K" edc:desc="First 383K" edc:when="(field &amp; 0x3ff) == 0x280"/>
              <edc:DCRFieldSemantic edc:cname="PWP384K" edc:desc="First 384K" edc:when="(field &amp; 0x3ff) == 0x27f"/>
              <edc:DCRFieldSemantic edc:cname="PWP385K" edc:desc="First 385K" edc:when="(field &amp; 0x3ff) == 0x27e"/>
              <edc:DCRFieldSemantic edc:cname="PWP386K" edc:desc="First 386K" edc:when="(field &amp; 0x3ff) == 0x27d"/>
              <edc:DCRFieldSemantic edc:cname="PWP387K" edc:desc="First 387K" edc:when="(field &amp; 0x3ff) == 0x27c"/>
              <edc:DCRFieldSemantic edc:cname="PWP388K" edc:desc="First 388K" edc:when="(field &amp; 0x3ff) == 0x27b"/>
              <edc:DCRFieldSemantic edc:cname="PWP389K" edc:desc="First 389K" edc:when="(field &amp; 0x3ff) == 0x27a"/>
              <edc:DCRFieldSemantic edc:cname="PWP390K" edc:desc="First 390K" edc:when="(field &amp; 0x3ff) == 0x279"/>
              <edc:DCRFieldSemantic edc:cname="PWP391K" edc:desc="First 391K" edc:when="(field &amp; 0x3ff) == 0x278"/>
              <edc:DCRFieldSemantic edc:cname="PWP392K" edc:desc="First 392K" edc:when="(field &amp; 0x3ff) == 0x277"/>
              <edc:DCRFieldSemantic edc:cname="PWP393K" edc:desc="First 393K" edc:when="(field &amp; 0x3ff) == 0x276"/>
              <edc:DCRFieldSemantic edc:cname="PWP394K" edc:desc="First 394K" edc:when="(field &amp; 0x3ff) == 0x275"/>
              <edc:DCRFieldSemantic edc:cname="PWP395K" edc:desc="First 395K" edc:when="(field &amp; 0x3ff) == 0x274"/>
              <edc:DCRFieldSemantic edc:cname="PWP396K" edc:desc="First 396K" edc:when="(field &amp; 0x3ff) == 0x273"/>
              <edc:DCRFieldSemantic edc:cname="PWP397K" edc:desc="First 397K" edc:when="(field &amp; 0x3ff) == 0x272"/>
              <edc:DCRFieldSemantic edc:cname="PWP398K" edc:desc="First 398K" edc:when="(field &amp; 0x3ff) == 0x271"/>
              <edc:DCRFieldSemantic edc:cname="PWP399K" edc:desc="First 399K" edc:when="(field &amp; 0x3ff) == 0x270"/>
              <edc:DCRFieldSemantic edc:cname="PWP400K" edc:desc="First 400K" edc:when="(field &amp; 0x3ff) == 0x26f"/>
              <edc:DCRFieldSemantic edc:cname="PWP401K" edc:desc="First 401K" edc:when="(field &amp; 0x3ff) == 0x26e"/>
              <edc:DCRFieldSemantic edc:cname="PWP402K" edc:desc="First 402K" edc:when="(field &amp; 0x3ff) == 0x26d"/>
              <edc:DCRFieldSemantic edc:cname="PWP403K" edc:desc="First 403K" edc:when="(field &amp; 0x3ff) == 0x26c"/>
              <edc:DCRFieldSemantic edc:cname="PWP404K" edc:desc="First 404K" edc:when="(field &amp; 0x3ff) == 0x26b"/>
              <edc:DCRFieldSemantic edc:cname="PWP405K" edc:desc="First 405K" edc:when="(field &amp; 0x3ff) == 0x26a"/>
              <edc:DCRFieldSemantic edc:cname="PWP406K" edc:desc="First 406K" edc:when="(field &amp; 0x3ff) == 0x269"/>
              <edc:DCRFieldSemantic edc:cname="PWP407K" edc:desc="First 407K" edc:when="(field &amp; 0x3ff) == 0x268"/>
              <edc:DCRFieldSemantic edc:cname="PWP408K" edc:desc="First 408K" edc:when="(field &amp; 0x3ff) == 0x267"/>
              <edc:DCRFieldSemantic edc:cname="PWP409K" edc:desc="First 409K" edc:when="(field &amp; 0x3ff) == 0x266"/>
              <edc:DCRFieldSemantic edc:cname="PWP410K" edc:desc="First 410K" edc:when="(field &amp; 0x3ff) == 0x265"/>
              <edc:DCRFieldSemantic edc:cname="PWP411K" edc:desc="First 411K" edc:when="(field &amp; 0x3ff) == 0x264"/>
              <edc:DCRFieldSemantic edc:cname="PWP412K" edc:desc="First 412K" edc:when="(field &amp; 0x3ff) == 0x263"/>
              <edc:DCRFieldSemantic edc:cname="PWP413K" edc:desc="First 413K" edc:when="(field &amp; 0x3ff) == 0x262"/>
              <edc:DCRFieldSemantic edc:cname="PWP414K" edc:desc="First 414K" edc:when="(field &amp; 0x3ff) == 0x261"/>
              <edc:DCRFieldSemantic edc:cname="PWP415K" edc:desc="First 415K" edc:when="(field &amp; 0x3ff) == 0x260"/>
              <edc:DCRFieldSemantic edc:cname="PWP416K" edc:desc="First 416K" edc:when="(field &amp; 0x3ff) == 0x25f"/>
              <edc:DCRFieldSemantic edc:cname="PWP417K" edc:desc="First 417K" edc:when="(field &amp; 0x3ff) == 0x25e"/>
              <edc:DCRFieldSemantic edc:cname="PWP418K" edc:desc="First 418K" edc:when="(field &amp; 0x3ff) == 0x25d"/>
              <edc:DCRFieldSemantic edc:cname="PWP419K" edc:desc="First 419K" edc:when="(field &amp; 0x3ff) == 0x25c"/>
              <edc:DCRFieldSemantic edc:cname="PWP420K" edc:desc="First 420K" edc:when="(field &amp; 0x3ff) == 0x25b"/>
              <edc:DCRFieldSemantic edc:cname="PWP421K" edc:desc="First 421K" edc:when="(field &amp; 0x3ff) == 0x25a"/>
              <edc:DCRFieldSemantic edc:cname="PWP422K" edc:desc="First 422K" edc:when="(field &amp; 0x3ff) == 0x259"/>
              <edc:DCRFieldSemantic edc:cname="PWP423K" edc:desc="First 423K" edc:when="(field &amp; 0x3ff) == 0x258"/>
              <edc:DCRFieldSemantic edc:cname="PWP424K" edc:desc="First 424K" edc:when="(field &amp; 0x3ff) == 0x257"/>
              <edc:DCRFieldSemantic edc:cname="PWP425K" edc:desc="First 425K" edc:when="(field &amp; 0x3ff) == 0x256"/>
              <edc:DCRFieldSemantic edc:cname="PWP426K" edc:desc="First 426K" edc:when="(field &amp; 0x3ff) == 0x255"/>
              <edc:DCRFieldSemantic edc:cname="PWP427K" edc:desc="First 427K" edc:when="(field &amp; 0x3ff) == 0x254"/>
              <edc:DCRFieldSemantic edc:cname="PWP428K" edc:desc="First 428K" edc:when="(field &amp; 0x3ff) == 0x253"/>
              <edc:DCRFieldSemantic edc:cname="PWP429K" edc:desc="First 429K" edc:when="(field &amp; 0x3ff) == 0x252"/>
              <edc:DCRFieldSemantic edc:cname="PWP430K" edc:desc="First 430K" edc:when="(field &amp; 0x3ff) == 0x251"/>
              <edc:DCRFieldSemantic edc:cname="PWP431K" edc:desc="First 431K" edc:when="(field &amp; 0x3ff) == 0x250"/>
              <edc:DCRFieldSemantic edc:cname="PWP432K" edc:desc="First 432K" edc:when="(field &amp; 0x3ff) == 0x24f"/>
              <edc:DCRFieldSemantic edc:cname="PWP433K" edc:desc="First 433K" edc:when="(field &amp; 0x3ff) == 0x24e"/>
              <edc:DCRFieldSemantic edc:cname="PWP434K" edc:desc="First 434K" edc:when="(field &amp; 0x3ff) == 0x24d"/>
              <edc:DCRFieldSemantic edc:cname="PWP435K" edc:desc="First 435K" edc:when="(field &amp; 0x3ff) == 0x24c"/>
              <edc:DCRFieldSemantic edc:cname="PWP436K" edc:desc="First 436K" edc:when="(field &amp; 0x3ff) == 0x24b"/>
              <edc:DCRFieldSemantic edc:cname="PWP437K" edc:desc="First 437K" edc:when="(field &amp; 0x3ff) == 0x24a"/>
              <edc:DCRFieldSemantic edc:cname="PWP438K" edc:desc="First 438K" edc:when="(field &amp; 0x3ff) == 0x249"/>
              <edc:DCRFieldSemantic edc:cname="PWP439K" edc:desc="First 439K" edc:when="(field &amp; 0x3ff) == 0x248"/>
              <edc:DCRFieldSemantic edc:cname="PWP440K" edc:desc="First 440K" edc:when="(field &amp; 0x3ff) == 0x247"/>
              <edc:DCRFieldSemantic edc:cname="PWP441K" edc:desc="First 441K" edc:when="(field &amp; 0x3ff) == 0x246"/>
              <edc:DCRFieldSemantic edc:cname="PWP442K" edc:desc="First 442K" edc:when="(field &amp; 0x3ff) == 0x245"/>
              <edc:DCRFieldSemantic edc:cname="PWP443K" edc:desc="First 443K" edc:when="(field &amp; 0x3ff) == 0x244"/>
              <edc:DCRFieldSemantic edc:cname="PWP444K" edc:desc="First 444K" edc:when="(field &amp; 0x3ff) == 0x243"/>
              <edc:DCRFieldSemantic edc:cname="PWP445K" edc:desc="First 445K" edc:when="(field &amp; 0x3ff) == 0x242"/>
              <edc:DCRFieldSemantic edc:cname="PWP446K" edc:desc="First 446K" edc:when="(field &amp; 0x3ff) == 0x241"/>
              <edc:DCRFieldSemantic edc:cname="PWP447K" edc:desc="First 447K" edc:when="(field &amp; 0x3ff) == 0x240"/>
              <edc:DCRFieldSemantic edc:cname="PWP448K" edc:desc="First 448K" edc:when="(field &amp; 0x3ff) == 0x23f"/>
              <edc:DCRFieldSemantic edc:cname="PWP449K" edc:desc="First 449K" edc:when="(field &amp; 0x3ff) == 0x23e"/>
              <edc:DCRFieldSemantic edc:cname="PWP450K" edc:desc="First 450K" edc:when="(field &amp; 0x3ff) == 0x23d"/>
              <edc:DCRFieldSemantic edc:cname="PWP451K" edc:desc="First 451K" edc:when="(field &amp; 0x3ff) == 0x23c"/>
              <edc:DCRFieldSemantic edc:cname="PWP452K" edc:desc="First 452K" edc:when="(field &amp; 0x3ff) == 0x23b"/>
              <edc:DCRFieldSemantic edc:cname="PWP453K" edc:desc="First 453K" edc:when="(field &amp; 0x3ff) == 0x23a"/>
              <edc:DCRFieldSemantic edc:cname="PWP454K" edc:desc="First 454K" edc:when="(field &amp; 0x3ff) == 0x239"/>
              <edc:DCRFieldSemantic edc:cname="PWP455K" edc:desc="First 455K" edc:when="(field &amp; 0x3ff) == 0x238"/>
              <edc:DCRFieldSemantic edc:cname="PWP456K" edc:desc="First 456K" edc:when="(field &amp; 0x3ff) == 0x237"/>
              <edc:DCRFieldSemantic edc:cname="PWP457K" edc:desc="First 457K" edc:when="(field &amp; 0x3ff) == 0x236"/>
              <edc:DCRFieldSemantic edc:cname="PWP458K" edc:desc="First 458K" edc:when="(field &amp; 0x3ff) == 0x235"/>
              <edc:DCRFieldSemantic edc:cname="PWP459K" edc:desc="First 459K" edc:when="(field &amp; 0x3ff) == 0x234"/>
              <edc:DCRFieldSemantic edc:cname="PWP460K" edc:desc="First 460K" edc:when="(field &amp; 0x3ff) == 0x233"/>
              <edc:DCRFieldSemantic edc:cname="PWP461K" edc:desc="First 461K" edc:when="(field &amp; 0x3ff) == 0x232"/>
              <edc:DCRFieldSemantic edc:cname="PWP462K" edc:desc="First 462K" edc:when="(field &amp; 0x3ff) == 0x231"/>
              <edc:DCRFieldSemantic edc:cname="PWP463K" edc:desc="First 463K" edc:when="(field &amp; 0x3ff) == 0x230"/>
              <edc:DCRFieldSemantic edc:cname="PWP464K" edc:desc="First 464K" edc:when="(field &amp; 0x3ff) == 0x22f"/>
              <edc:DCRFieldSemantic edc:cname="PWP465K" edc:desc="First 465K" edc:when="(field &amp; 0x3ff) == 0x22e"/>
              <edc:DCRFieldSemantic edc:cname="PWP466K" edc:desc="First 466K" edc:when="(field &amp; 0x3ff) == 0x22d"/>
              <edc:DCRFieldSemantic edc:cname="PWP467K" edc:desc="First 467K" edc:when="(field &amp; 0x3ff) == 0x22c"/>
              <edc:DCRFieldSemantic edc:cname="PWP468K" edc:desc="First 468K" edc:when="(field &amp; 0x3ff) == 0x22b"/>
              <edc:DCRFieldSemantic edc:cname="PWP469K" edc:desc="First 469K" edc:when="(field &amp; 0x3ff) == 0x22a"/>
              <edc:DCRFieldSemantic edc:cname="PWP470K" edc:desc="First 470K" edc:when="(field &amp; 0x3ff) == 0x229"/>
              <edc:DCRFieldSemantic edc:cname="PWP471K" edc:desc="First 471K" edc:when="(field &amp; 0x3ff) == 0x228"/>
              <edc:DCRFieldSemantic edc:cname="PWP472K" edc:desc="First 472K" edc:when="(field &amp; 0x3ff) == 0x227"/>
              <edc:DCRFieldSemantic edc:cname="PWP473K" edc:desc="First 473K" edc:when="(field &amp; 0x3ff) == 0x226"/>
              <edc:DCRFieldSemantic edc:cname="PWP474K" edc:desc="First 474K" edc:when="(field &amp; 0x3ff) == 0x225"/>
              <edc:DCRFieldSemantic edc:cname="PWP475K" edc:desc="First 475K" edc:when="(field &amp; 0x3ff) == 0x224"/>
              <edc:DCRFieldSemantic edc:cname="PWP476K" edc:desc="First 476K" edc:when="(field &amp; 0x3ff) == 0x223"/>
              <edc:DCRFieldSemantic edc:cname="PWP477K" edc:desc="First 477K" edc:when="(field &amp; 0x3ff) == 0x222"/>
              <edc:DCRFieldSemantic edc:cname="PWP478K" edc:desc="First 478K" edc:when="(field &amp; 0x3ff) == 0x221"/>
              <edc:DCRFieldSemantic edc:cname="PWP479K" edc:desc="First 479K" edc:when="(field &amp; 0x3ff) == 0x220"/>
              <edc:DCRFieldSemantic edc:cname="PWP480K" edc:desc="First 480K" edc:when="(field &amp; 0x3ff) == 0x21f"/>
              <edc:DCRFieldSemantic edc:cname="PWP481K" edc:desc="First 481K" edc:when="(field &amp; 0x3ff) == 0x21e"/>
              <edc:DCRFieldSemantic edc:cname="PWP482K" edc:desc="First 482K" edc:when="(field &amp; 0x3ff) == 0x21d"/>
              <edc:DCRFieldSemantic edc:cname="PWP483K" edc:desc="First 483K" edc:when="(field &amp; 0x3ff) == 0x21c"/>
              <edc:DCRFieldSemantic edc:cname="PWP484K" edc:desc="First 484K" edc:when="(field &amp; 0x3ff) == 0x21b"/>
              <edc:DCRFieldSemantic edc:cname="PWP485K" edc:desc="First 485K" edc:when="(field &amp; 0x3ff) == 0x21a"/>
              <edc:DCRFieldSemantic edc:cname="PWP486K" edc:desc="First 486K" edc:when="(field &amp; 0x3ff) == 0x219"/>
              <edc:DCRFieldSemantic edc:cname="PWP487K" edc:desc="First 487K" edc:when="(field &amp; 0x3ff) == 0x218"/>
              <edc:DCRFieldSemantic edc:cname="PWP488K" edc:desc="First 488K" edc:when="(field &amp; 0x3ff) == 0x217"/>
              <edc:DCRFieldSemantic edc:cname="PWP489K" edc:desc="First 489K" edc:when="(field &amp; 0x3ff) == 0x216"/>
              <edc:DCRFieldSemantic edc:cname="PWP490K" edc:desc="First 490K" edc:when="(field &amp; 0x3ff) == 0x215"/>
              <edc:DCRFieldSemantic edc:cname="PWP491K" edc:desc="First 491K" edc:when="(field &amp; 0x3ff) == 0x214"/>
              <edc:DCRFieldSemantic edc:cname="PWP492K" edc:desc="First 492K" edc:when="(field &amp; 0x3ff) == 0x213"/>
              <edc:DCRFieldSemantic edc:cname="PWP493K" edc:desc="First 493K" edc:when="(field &amp; 0x3ff) == 0x212"/>
              <edc:DCRFieldSemantic edc:cname="PWP494K" edc:desc="First 494K" edc:when="(field &amp; 0x3ff) == 0x211"/>
              <edc:DCRFieldSemantic edc:cname="PWP495K" edc:desc="First 495K" edc:when="(field &amp; 0x3ff) == 0x210"/>
              <edc:DCRFieldSemantic edc:cname="PWP496K" edc:desc="First 496K" edc:when="(field &amp; 0x3ff) == 0x20f"/>
              <edc:DCRFieldSemantic edc:cname="PWP497K" edc:desc="First 497K" edc:when="(field &amp; 0x3ff) == 0x20e"/>
              <edc:DCRFieldSemantic edc:cname="PWP498K" edc:desc="First 498K" edc:when="(field &amp; 0x3ff) == 0x20d"/>
              <edc:DCRFieldSemantic edc:cname="PWP499K" edc:desc="First 499K" edc:when="(field &amp; 0x3ff) == 0x20c"/>
              <edc:DCRFieldSemantic edc:cname="PWP500K" edc:desc="First 500K" edc:when="(field &amp; 0x3ff) == 0x20b"/>
              <edc:DCRFieldSemantic edc:cname="PWP501K" edc:desc="First 501K" edc:when="(field &amp; 0x3ff) == 0x20a"/>
              <edc:DCRFieldSemantic edc:cname="PWP502K" edc:desc="First 502K" edc:when="(field &amp; 0x3ff) == 0x209"/>
              <edc:DCRFieldSemantic edc:cname="PWP503K" edc:desc="First 503K" edc:when="(field &amp; 0x3ff) == 0x208"/>
              <edc:DCRFieldSemantic edc:cname="PWP504K" edc:desc="First 504K" edc:when="(field &amp; 0x3ff) == 0x207"/>
              <edc:DCRFieldSemantic edc:cname="PWP505K" edc:desc="First 505K" edc:when="(field &amp; 0x3ff) == 0x206"/>
              <edc:DCRFieldSemantic edc:cname="PWP506K" edc:desc="First 506K" edc:when="(field &amp; 0x3ff) == 0x205"/>
              <edc:DCRFieldSemantic edc:cname="PWP507K" edc:desc="First 507K" edc:when="(field &amp; 0x3ff) == 0x204"/>
              <edc:DCRFieldSemantic edc:cname="PWP508K" edc:desc="First 508K" edc:when="(field &amp; 0x3ff) == 0x203"/>
              <edc:DCRFieldSemantic edc:cname="PWP509K" edc:desc="First 509K" edc:when="(field &amp; 0x3ff) == 0x202"/>
              <edc:DCRFieldSemantic edc:cname="PWP510K" edc:desc="First 510K" edc:when="(field &amp; 0x3ff) == 0x201"/>
              <edc:DCRFieldSemantic edc:cname="PWP511K" edc:desc="First 511K" edc:when="(field &amp; 0x3ff) == 0x200"/>
              <edc:DCRFieldSemantic edc:cname="PWP512K" edc:desc="First 512K" edc:when="(field &amp; 0x3ff) == 0x1ff"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="BWP" edc:desc="Boot Flash Write Protect bit" edc:mask="0x1" edc:name="BWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1d000000" edc:checksumalgo="0x80" edc:endaddr="0x1d07ffff"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x00" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x4000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
